# ExportLineweightKey Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightKey Constructor
ExportLineweightKey Class See Also
---
Constructs a new default ExportLineweightKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLineweightKey()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLineweightKey()
```

# See Also
ExportLineweightKey Class
ExportLineweightKey Overload
Autodesk.Revit.DB Namespace